<template>
<u-md>


## 多分类搜索实现

### 需求分析
> 需完成一个多途径搜索的选择的功能
* 多站点搜索 （不同站点对应不同的URL）
* 同一站点对应3总搜索 （个人收藏|本组织架构搜索|全站搜索）

### UI设计
```
    个人收藏|组织架构|全站 (默认个人选中)
    搜索框（后面带搜索符号，点击或按enter开始搜索）
    ------------------------------------------
    搜索内容展示1 （条目内容）
    搜索内容展示2
    搜索内容展示3
    搜索内容展示4
    搜索内容展示5
    ------------------------------------------
    1 2 3 4 5 （分页）
```

### 接口策划
* 定义某站点URL为 http://[域名地址]]/api/[业务地址] （使用GET协议）
* 定义站点搜索类型为 search_type = people|organization|global(个人|组织|全网)
* 定义搜索参数为 search （传参内容为搜索框内容）

#### 接口传参
参数|描述
---|---
search_type|搜索类型 【必填】 可选值 `people,organization,global`
search|搜索内容 【非必填】 为空 不返回内容


响应内容

> 成功情况：

```javascript
{
    "status": "0",
    "data": [
        label:'某某某创建的内容',   // 显示给用户的内容
        value:'10001',             //  系统使用的id
    ]
}
```
> 无匹配情况：

```javascript
{
    "status": "0",
    "data": []
}

```
> 失败情况：

```javascript
{
    "status": "500",
    "message": "检索失败"
}
```
</u-md>
</template>

<script>
export default {

}
</script>

<style>

</style>
